# 1장 - 서울시 구별 CCTV 현황 분석



## 1-1 CCTV 현황과 인구 현황 데이터 구하기


서울시의 CCTV 현황은 구글 검색만으로도 쉽게 구할 수 있다. '서울시 자치구 연도별 CCTV 설치 현황'을 검색하면 '서울 열린데이터 광장' 사이트의 해당 페이지로 갈 수 있다. csv 파일은 콤마로 구분된 파일이다. 우리나라에서는 잘 통용되지 않지만 외국 자료를 검색하다 보면 자주 나타난다. 텍스트 파일이기 때문에 메모장에서도 열린다. 그런데 만약 csv 파일에 한글이 UTF-8로 인코딩되어 있다면 엑셀에서 열었을때 한글이 깨져 보일 수 있다.
나는 위 책의 나와있는 github에서 data를 다운 받았다.

(데이터 출처: https://github.com/PinkWink/DataScience)



## 1-2  파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas


앞서 얻은 파일을 읽어와야 한다. 파이썬에서는 이런 종류의 파일을 아주 손쉽게 읽을 수 있는 모듈이 있다. 바로 pandas 이다.

In [59]:
import pandas as pd

앞으로도 위 코드와 같이 대부분의 시작은 import로 하게 될 것이다. 파이썬에서 원하는 모듈을 불러오는 명령이 import 이다. 모듈명 다음의 as는 as 뒤에 붙는 pd라는 짧은 단어로 pandas를 대체한다는 뜻이다.
pandas에서 csv파일을 읽는 명령은 read_csv 이다. 그 안에 한글을 사용하는 경우는 인코딩에 신경 써야 한다. 우리가 받은 cctv 데이터는 UTF-8로 인코딩 되어 있어서 read_csv 명령을 쓸 때 encoding 옵션에 UTF-8 이라고 지정한다.

In [60]:
CCTV_Seoul = pd.read_csv('/home/jaeyoon89/DataScience/data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

pandas 데이터는 제일 첫 줄에 보이는 것이 해당하는 열(column)을 대표하는 일종의 제목이다. 그래서 첫 줄을 column 이라고 한다. 데이터 뒤에 columns 라고 하면 column의 이름들이 반환된다.

In [61]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [62]:
CCTV_Seoul.columns[0]

'기관명'

기관명이라고 되어 있어 이를 '구별' 이라는 이름으로 하자. 이렇게 이름을 바꾸는 명령은 rename 이라고 한다.

In [63]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [64]:
!pip3 install xlrd

Collecting xlrd
  Using cached https://files.pythonhosted.org/packages/a6/0c/c2a72d51fe56e08a08acc85d13013558a2d793028ae7385448a6ccdfae64/xlrd-2.0.1-py2.py3-none-any.whl
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

이번엔 두 번째 받은 엑셀 파일을 읽어야 한다. 그 명령은 read_excel이다. 그냥 인코딩만 지정하고 읽었더니 약간 이상하다. 그것은 원본 엑셀 파일이 아래에서 보이는 것처럼 첫 세 줄이 열의 제목처럼 되어 있기 때문이다.

In [65]:
pop_Seoul = pd.read_excel('/home/jaeyoon89/DataScience/data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

그리고 엑셀파일을 읽을 때는 옵션을 좀 더 많이 적용해 보자. 일단 엑셀을 읽는 read_excel 명령 안에서 세 번째 줄부터 읽으라는 header=2 라는 옵션을 걸고, B,D,G,J,N 열만 읽도록 usecols='B,D,G,J,N' 이라는 옵션을 넣었다.

In [66]:
pop_Seoul = pd.read_excel('/home/jaeyoon89/DataScience/data/01. population_in_Seoul.xls',header =2,
                         usecols = 'B,D,G,J,N',
                         )
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

출력된 모습도 간결하게 되었다. 하지만 컬럼의 이름에 문제가 있는거 같아 rename 명령을 사용해서 컬럼의 이름을 변경한다.

In [67]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                         pop_Seoul.columns[1] : '인구수',
                         pop_Seoul.columns[2] : '한국인',
                         pop_Seoul.columns[3] : '외국인',
                         pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

이제 어느정도 정돈된 모습이다. CCTV_Seoul 이라는 변수에는 '구별 CCTV 현황'을 pop_Seoul 이라는 변수에는 '구별 인구 현황'을 저장했다.
pandas 에서 몇줄 입력하지 않았는데 우리는 두 종류의 파일을 보기 좋게 읽었다.


## 1-3 pandas 기초 익히기


이 절의 튜토리얼에서는 pandas의 기초 튜토리얼을 익히고 지나가자.

In [68]:
import pandas as pd
import numpy as np

pandas 와 numpy 를 import 했다. 이 두 모듈은 자주 사용하는 모듈이면서 함께 쓰면 유용하다.

In [69]:
s= pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas의 데이터 유형 중 기초가 되는 것이 Series 이다. 대괄호로 만드는 파이썬의 list데이터로 만들 수 있다.

In [70]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

또 pandas 에는 날짜형의 데이터인 date_range가 있다. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정한다.

In [71]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

df

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190
2013-01-06 -0.746761 -1.431688  0.100374  1.501924

이제 DataFrame 유형의 데이터를 만든다. 6행 4열의 random 변수를 만들고, 컬럼에서 위와같이 A,B,C,D 로 지정하고 index 명령으로 전 단계에서 만든 날짜형 데이터인 dates를 index=dates 옵션을 이용해서 지정했다.

In [72]:
df.head(3)

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930

head() 명령을 사용하면 기본적으로 첫 5행을 보여준다. 괄호 안에 숫자를 넣으면 그 숫자만큼의 행을 볼 수 있다.

In [73]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [74]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

그리고 index, columns 명령을 이용하면 pandas의 DataFrame의 컬럼과 인덱스를 확인할 수 있다.

In [75]:
df.values

array([[ 0.03969015, -0.33903541, -0.30131614, -0.66390357],
       [ 1.15739624, -0.27554627, -1.93531681, -0.73490969],
       [-1.3419726 ,  0.1394981 ,  0.05922904, -0.64092986],
       [-0.78883308,  0.08087651, -0.63939332, -1.46635193],
       [-1.05172769, -0.53596923,  0.24781238, -0.6621902 ],
       [-0.74676089, -1.43168792,  0.10037377,  1.50192417]])

그리고 그 안에 들어가는 내용은 values 명령으로 확인할 수 있다. 그리고 info() 명령을 사용하면 DataFrame의 개요를 알 수 있다.

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe() 명령을 사용하면 통계적 개요를 확인할 수 있다. 아래처럼 평균과 개수, min, max, 표준편차까지 알 수 있다.

In [77]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.455368 -0.393644 -0.411435 -0.444394
std    0.914758  0.569935  0.812944  1.005107
min   -1.341973 -1.431688 -1.935317 -1.466352
25%   -0.986004 -0.486736 -0.554874 -0.717158
50%   -0.767797 -0.307291 -0.121044 -0.663047
75%   -0.156923 -0.008229  0.090088 -0.646245
max    1.157396  0.139498  0.247812  1.501924

이때 values가 숫자가 아니라 문자라고 하더라도 그에 맞는 개요가 나타난다.

In [78]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190
2013-01-06 -0.746761 -1.431688  0.100374  1.501924

sort_values 명령은 by로 지정된 컬럼을 기준으로 정렬한다. ascending 옵션을 사용하면 내림차순이나 오름차순으로 정렬시킬 수 있다.

In [79]:
df

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190
2013-01-06 -0.746761 -1.431688  0.100374  1.501924

그냥 변수명을 적고 실행 하면 그 내용이 나타난다. 너무 많으면 jupyter notebook 에서 내용을 줄인다.

In [80]:
df['A']

2013-01-01    0.039690
2013-01-02    1.157396
2013-01-03   -1.341973
2013-01-04   -0.788833
2013-01-05   -1.051728
2013-01-06   -0.746761
Freq: D, Name: A, dtype: float64

DataFrame으로 선언된 변수의 경우 변수명 뒤에 ['A']와 같이 붙여주면 해당 컬럼만 Series로 보여준다. 중간부터 보고싶다면 df[0:3]이라고 하면 된다.

In [81]:
df[0:3]

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930

만약 2013.01.02 부터 2013.01.04 까지의 행을 보고 싶다면 아래과 같이 하면 된다.

In [82]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352

앞에서 만든 dates 변수를 이용해 특정 날짜의 데이터만 보고 싶으면 df.loc 명령을 사용하면 된다. loc는 location 옵션으로 슬라이싱 할 때 loc 옵션을 이용해서 위치 값을 지정할 수 있다.

In [83]:
df.loc[dates[0]]

A    0.039690
B   -0.339035
C   -0.301316
D   -0.663904
Name: 2013-01-01 00:00:00, dtype: float64

A,B 열의 모든 행을 보고싶으면 df.loc['A','B']라고 하면 된다.

In [84]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.039690 -0.339035
2013-01-02  1.157396 -0.275546
2013-01-03 -1.341973  0.139498
2013-01-04 -0.788833  0.080877
2013-01-05 -1.051728 -0.535969
2013-01-06 -0.746761 -1.431688

물론 행과 열의 범위를 모두 지정할 수 있다.

In [85]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.157396 -0.275546
2013-01-03 -1.341973  0.139498
2013-01-04 -0.788833  0.080877

In [86]:
df.loc['20130102',['A','B']]

A    1.157396
B   -0.275546
Name: 2013-01-02 00:00:00, dtype: float64

In [87]:
df.loc[dates[0],'A']

0.03969014760268723

하지만 loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근할 때 쓰는 명령어가 iloc 입니다. iloc을 사용하면 행이나 열의 범위를 지정하면 된다. 특히 콜론(:)을 사용하면 전체를 의미한다.

In [88]:
df.iloc[3]

A   -0.788833
B    0.080877
C   -0.639393
D   -1.466352
Name: 2013-01-04 00:00:00, dtype: float64

먼저 iloc에 단지 숫자만 표시하면 3번행(0번부터시작) 즉 4번째 행이 나온다.

In [89]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.788833  0.080877
2013-01-05 -1.051728 -0.535969

또 위처럼 3번째부터 5번째 앞, 즉 3번째부터 4번째까지 행과 0번부터 1번까지 열의 데이터만 가져올 수 있다.

In [90]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.157396 -1.935317
2013-01-03 -1.341973  0.059229
2013-01-05 -1.051728  0.247812

또 범위가 아니라 콤마로 행이나 열을 지정해서 데이터를 위처럼 가져올 수 있다. 행이나 열에 대해 한쪽은 전체를 의미하게 하고 싶을때는 그냥 콜론만 사용하면 된다.

In [91]:
df.iloc[1:3,:]

                   A         B         C        D
2013-01-02  1.157396 -0.275546 -1.935317 -0.73491
2013-01-03 -1.341973  0.139498  0.059229 -0.64093

In [92]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.339035 -0.301316
2013-01-02 -0.275546 -1.935317
2013-01-03  0.139498  0.059229
2013-01-04  0.080877 -0.639393
2013-01-05 -0.535969  0.247812
2013-01-06 -1.431688  0.100374

반대로 행을 전체로 선택했다. 다시 df를 호출하자.

In [93]:
df

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190
2013-01-06 -0.746761 -1.431688  0.100374  1.501924

DataFrame에서 특정 조건을 만족하는 데이터만 얻을 수 있다. 컬럼을 지정할 때 df['A']처럼 할 수도 있고, df.A와 같이 할 수도 있다. 컬럼 A에서 0보다 큰 행만 얻는 것이다.

In [94]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 된다.

In [95]:
df[df>0]

                   A         B         C         D
2013-01-01  0.039690       NaN       NaN       NaN
2013-01-02  1.157396       NaN       NaN       NaN
2013-01-03       NaN  0.139498  0.059229       NaN
2013-01-04       NaN  0.080877       NaN       NaN
2013-01-05       NaN       NaN  0.247812       NaN
2013-01-06       NaN       NaN  0.100374  1.501924

DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사하면 실제 데이터의 내용이 복사되는 것이 아니라 데이터 위치만 복사되기 때문에 원본 데이터는 하나만 있게된다. 데이터 내용까지 복사하라는 지령은 copy() 옵션을 붙이면 된다.

In [96]:
df2 = df.copy()

In [97]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904    one
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910    one
2013-01-03 -1.341973  0.139498  0.059229 -0.640930    two
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352  three
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190   four
2013-01-06 -0.746761 -1.431688  0.100374  1.501924  three

원래 있는 DataFrame 에서 새로운 컬럼을 추가하는 것은 위처럼 하면 된다.

In [98]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

위에서 만든 E 컬럼에서 two와 four 가 있는지 조건을 걸고 싶을땐 isin 명령을 쓰면 된다.

In [99]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C        D     E
2013-01-03 -1.341973  0.139498  0.059229 -0.64093   two
2013-01-05 -1.051728 -0.535969  0.247812 -0.66219  four

그 결과는 True/False로 반환되는데, 이것을 이용하면 조건에 맞는 데이터를 선택할 수 있다.

In [100]:
df

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.157396 -0.275546 -1.935317 -0.734910
2013-01-03 -1.341973  0.139498  0.059229 -0.640930
2013-01-04 -0.788833  0.080877 -0.639393 -1.466352
2013-01-05 -1.051728 -0.535969  0.247812 -0.662190
2013-01-06 -0.746761 -1.431688  0.100374  1.501924

df 변수에서 좀 더 통계 느낌의 데이터를 볼 때는 특정 함수를 적용시키면 좋다. 이때 사용하는 것이 apply 명령이다. 누적합을 알고 싶을 때는 numpy의 cumsum을 이용하면 된다.

In [101]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.039690 -0.339035 -0.301316 -0.663904
2013-01-02  1.197086 -0.614582 -2.236633 -1.398813
2013-01-03 -0.144886 -0.475084 -2.177404 -2.039743
2013-01-04 -0.933719 -0.394207 -2.816797 -3.506095
2013-01-05 -1.985447 -0.930176 -2.568985 -4.168285
2013-01-06 -2.732208 -2.361864 -2.468611 -2.666361

특별히 최대값과 최소값의 차이를 알고 싶다면 one-line 함수인 lambda를 이용할 수 도 있다.

In [102]:
df.apply(lambda x: x.max() - x.min())

A    2.499369
B    1.571186
C    2.183129
D    2.968276
dtype: float64

## 1-4 pandas 이용해서 CCTV와 인구현황 데이터 파악하기


이제 기초가 되는 pandas도 익혔으니 두 데이터를 정리해 보자.

In [103]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

구별 CCTV 데이터에서 CCTV 전체 개수인 소계로 정렬하자.

In [104]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

CCTV의 전체 개수가 가장 작은 구는 도봉구, 마포구, 송파구, 중랑구, 중구 라는 것을 알 수 있다. 의아한 것은 강남 3구 중 하나인 송파구가 CCTV가 가장 적은 구 중 하나라는 건데 앞에서 보면 송파구는 범죄율이 결코 낮은 구가 아니다. 그런데 CCTV가 적은 구 중에 하나이다.

In [105]:
CCTV_Seoul.sort_values(by = '소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

그리고 CCTV가 가장 많은 구는 강남구, 양천구, 서초구, 은평구, 용산구로 나타난다. 특히 2014년 부터 2016년 까지 최근 3년간 CCTV 수를 더하고 2013년 이전 CCTV 수로 나눠서 최근 3년간 CCTV 증가율을 계산하자.

In [106]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전'] *100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

그 결과를 보면 최근 3년간 CCTV가 그 이전 대비 많이 증가한 구는 종로구, 도봉구, 마포구, 노원구, 강동구 라는 것을 알 수 있다. 이제 서울시 인구 현황을 정리해 보자.

In [107]:
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

먼저 pop_Seoul 변수를 확인 했더니 0번 행에 합계가 보인다. 이것은 우리에게 필요가 없다. 이럴 때는 drop 명령을 사용해서 지우자.

In [108]:
pop_Seoul.drop([0], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

그리고 pop_Seoul 데이터의 '구별' 컬럼의 unique를 조사하자. 유니크 조사는 반복된 데이터는 하나로 나타내서 한 번 이상 나타난 데이터를 확인하는 것이다.

In [109]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

이렇게 유니크 조사를 했더니 제일 끝에 Nan이 보인다. NaN이 어디에 있는지 확인하기 위해서는 조건문을 사용해야 한다. isnull 명령으로 NaN 데이터를 추출할 수 있다.

In [110]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

행을 지우는 drop 명령으로 NaN 이 있던 행을 삭제하자.

In [111]:
pop_Seoul.drop([26], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

이제 각 구별 전체 인구를 이용해서 구별 외국인비율과 고령자비율을 계산해보자.

In [112]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

인구수로 정렬했더니 송파구, 강서구, 강남구, 노원구, 관악구 순으로 인구가 많다.

In [113]:
pop_Seoul.sort_values(by='인구수', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [114]:
pop_Seoul.sort_values(by='외국인', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [115]:
pop_Seoul.sort_values(by='외국인비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

외국인 숫자가 많은구는 영등포구, 구로구, 금천구, 관악구, 동대문구 이지만 외국인 비율이 높은 구는 영등포, 금천구, 구로구, 중구, 용산구로 조금 바뀐다.

In [116]:
pop_Seoul.sort_values(by='고령자', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [117]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

이제 고령자와 고령자 비율을 조사해 보자. 고령자가 많은 구는 강서구, 송파구, 은평구, 노원구 관악구 이지만, 고령자 비율이 높은 구는 강북구, 종로구, 중구, 용산구, 서대문구로 차이가 좀 난다. 이렇게 비록 한정된 내용이지만 데이터들은 확인을 했다. 지금까지 확인한 내용도 중요하지만 여전히 우리는 CCTV의 현황을 완전히 파악하진 않았다. 인구 대비 CCTV 현황 같은 내용을 확인하고 싶은데, 그러기 위해선 두 데이터를 병합해야 한다.


출처 : 파이썬으로 데이터 주무르기